src/posts/java-learn-maven/index.org
#+TITLE: Maven 学习笔记
#+KEYWORDS: 珊瑚礁上的程序员, Java, Maven
#+DATE: <2025-01-12 Sun 19:00>

* 通过命令行创建空的 =maven= 项目骨架

** 1. 从 Maven 模板创建项目
#+begin_src shell
  mvn archetype:generate \
      -DgroupId=com.example \
      -DartifactId=my-maven-demo \
      -DarchetypeArtifactId=maven-archetype-quickstart \
      -DinteractiveMode=false
#+end_src

#+begin_example
  ...
  [INFO] ----------------------------------------------------------------------------
  [INFO] Using following parameters for creating project from Old (1.x) Archetype: maven-archetype-quickstart:1.0
  [INFO] ----------------------------------------------------------------------------
  [INFO] Parameter: basedir, Value: /tmp
  [INFO] Parameter: package, Value: com.example
  [INFO] Parameter: groupId, Value: com.example
  [INFO] Parameter: artifactId, Value: my-maven-demo
  [INFO] Parameter: packageName, Value: com.example
  [INFO] Parameter: version, Value: 1.0-SNAPSHOT
  [INFO] project created from Old (1.x) Archetype in dir: /tmp/my-maven-demo
  [INFO] ------------------------------------------------------------------------
  [INFO] BUILD SUCCESS
  [INFO] ------------------------------------------------------------------------
  [INFO] Total time:  3.908 s
  [INFO] Finished at: 2025-01-17T23:21:31+08:00
  [INFO] ------------------------------------------------------------------------
#+end_example

** 2. 生成的项目目录结构
#+begin_example
  $ tree my-maven-demo
  maven-demo
  ├── pom.xml
  └── src
      ├── main
      │   └── java
      │       └── com
      │           └── example
      │               └── App.java
      └── test
          └── java
              └── com
                  └── example
                      └── AppTest.java

  10 directories, 3 files
#+end_example

** 3. 生成 =pom.xml= 文件内容
生成的内容如下, 仅包含一个 jUnit 依赖项.
#+begin_src xml
  <project xmlns="http://maven.apache.org/POM/4.0.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/maven-v4_0_0.xsd">
    <modelVersion>4.0.0</modelVersion>
    <groupId>com.example</groupId>
    <artifactId>my-maven-demo</artifactId>
    <packaging>jar</packaging>
    <version>1.0-SNAPSHOT</version>
    <name>maven-demo</name>
    <url>http://maven.apache.org</url>
    <dependencies>
      <dependency>
        <groupId>junit</groupId>
        <artifactId>junit</artifactId>
        <version>3.8.1</version>
        <scope>test</scope>
      </dependency>
    </dependencies>
  </project>
#+end_src

