src/posts/java-learn-maven/index.org
** 4. 更新 =pom.xml= 文件
4.1 增加编译器属性，告诉 Maven 使用指定的 JDK 版本来编译源码
#+begin_src xml
  <properties>
    <!-- 指定项目构建时的源文件编码格式, 防止源文件中的非 ASCII 字符出现乱码 -->
    <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>
    <!-- 指定项目源代码所使用的 Java 版本 -->
    <maven.compiler.source>1.8</maven.compiler.source>
    <!-- 指定编译后的字节码目标版本 -->
    <maven.compiler.target>1.8</maven.compiler.target>
  </properties>
#+end_src

4.2 升级到 jUnit4
#+begin_src xml
  <dependency>
    <groupId>junit</groupId>
    <artifactId>junit</artifactId>
    <version>4.13.2</version>
    <scope>test</scope>
  </dependency>
#+end_src

* Maven 项目构建与运行
接上面创建的 maven 项目骨架，继续进行项目的编译与打包.

** 1. 增加依赖项
为更好的演示打包的效果, 增加一个依赖项.
#+begin_src xml
  <dependency>
    <groupId>commons-codec</groupId>
    <artifactId>commons-codec</artifactId>
    <version>1.17.2</version>
  </dependency>
#+end_src

** 2. 编写代码
2.1 编写代码
=src/main/java/com/example/App.java=
#+begin_src java
  package com.example;

  import org.apache.commons.codec.digest.DigestUtils;

  public class App {
      public static void main(String[] args) {

          if (args.length < 1) {
              System.err.println("请输入任意字符串!");
              System.exit(0);
          }
          System.out.println("SHA-256哈希值为: " + sha256hex(args[0]));
      }

      public static String sha256hex(String input) {
          return DigestUtils.sha256Hex(input);
      }
  }
#+end_src

2.2 编写单元测试
=com/example/AppTest.java=
#+begin_src java
  package com.example;

  import org.junit.Test;

  import static org.junit.Assert.*;

  public class AppTest {

      @Test
      public void sha256hex() {
          assertEquals("8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92", App.sha256hex("123456"));
      }
  }
#+end_src

** 3. maven 构建
执行 =mvn package= 完成构建
#+begin_example
  $ mvn package
  [INFO] Scanning for projects...
  [INFO]
  [INFO] ---------------------< com.example:my-maven-demo >----------------------
  [INFO] Building my-maven-demo 1.0-SNAPSHOT
  [INFO]   from pom.xml
  [INFO] --------------------------------[ jar ]---------------------------------
  [INFO]
  [INFO] --- resources:3.3.1:resources (default-resources) @ my-maven-demo ---
  [INFO] skip non existing resourceDirectory /tmp/my-maven-demo/src/main/resources
  [INFO]
  [INFO] --- compiler:3.13.0:compile (default-compile) @ my-maven-demo ---
  [INFO] Recompiling the module because of changed source code.
  [INFO] Compiling 1 source file with javac [debug target 1.8] to target/classes
  [INFO]
  [INFO] --- resources:3.3.1:testResources (default-testResources) @ my-maven-demo ---
  [INFO] skip non existing resourceDirectory /tmp/my-maven-demo/src/test/resources
  [INFO]
  [INFO] --- compiler:3.13.0:testCompile (default-testCompile) @ my-maven-demo ---
  [INFO] Recompiling the module because of changed dependency.
  [INFO] Compiling 1 source file with javac [debug target 1.8] to target/test-classes
  [INFO]
  [INFO] --- surefire:3.2.5:test (default-test) @ my-maven-demo ---
  [INFO] Using auto detected provider org.apache.maven.surefire.junit4.JUnit4Provider
  [INFO]
  [INFO] -------------------------------------------------------
  [INFO]  T E S T S
  [INFO] -------------------------------------------------------
  [INFO] Running com.example.AppTest
  [INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0.111 s -- in com.example.AppTest
  [INFO]
  [INFO] Results:
  [INFO]
  [INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0
  [INFO]
  [INFO]
  [INFO] --- jar:3.4.1:jar (default-jar) @ my-maven-demo ---
  [INFO] Building jar: /tmp/my-maven-demo/target/my-maven-demo-1.0-SNAPSHOT.jar
  [INFO] ------------------------------------------------------------------------
  [INFO] BUILD SUCCESS
  [INFO] ------------------------------------------------------------------------
  [INFO] Total time:  4.145 s
  [INFO] Finished at: 2025-01-16T23:40:30+08:00
  [INFO] ------------------------------------------------------------------------
#+end_example

