posts/java-learn-maven/index.html

<div id="outline-container-orgeaf1c71" class="outline-3">
<h3 id="orgeaf1c71">4. 更新 <code>pom.xml</code> 文件</h3>
<div class="outline-text-3" id="text-orgeaf1c71">
<p>
4.1 增加编译器属性，告诉 Maven 使用指定的 JDK 版本来编译源码
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">properties</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#25351;&#23450;&#39033;&#30446;&#26500;&#24314;&#26102;&#30340;&#28304;&#25991;&#20214;&#32534;&#30721;&#26684;&#24335;, &#38450;&#27490;&#28304;&#25991;&#20214;&#20013;&#30340;&#38750; ASCII &#23383;&#31526;&#20986;&#29616;&#20081;&#30721;</span><span class="org-comment-delimiter"> --&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">project.build.sourceEncoding</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">UTF-8</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">project.build.sourceEncoding</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#25351;&#23450;&#39033;&#30446;&#28304;&#20195;&#30721;&#25152;&#20351;&#29992;&#30340; Java &#29256;&#26412;</span><span class="org-comment-delimiter"> --&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">maven.compiler.source</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">1.8</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">maven.compiler.source</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#25351;&#23450;&#32534;&#35793;&#21518;&#30340;&#23383;&#33410;&#30721;&#30446;&#26631;&#29256;&#26412;</span><span class="org-comment-delimiter"> --&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">maven.compiler.target</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">1.8</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">maven.compiler.target</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">properties</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
4.2 升级到 jUnit4
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">dependency</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">groupId</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">junit</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">groupId</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">artifactId</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">junit</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">artifactId</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">version</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">4.13.2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">version</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">scope</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">test</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">scope</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">dependency</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>
</section>

<section id="outline-container-org7ec7288" class="outline-2">
<h2 id="org7ec7288">Maven 项目构建与运行</h2>
<div class="outline-text-2" id="text-org7ec7288">
<p>
接上面创建的 maven 项目骨架，继续进行项目的编译与打包.
</p>
</div>

<div id="outline-container-org202bfd1" class="outline-3">
<h3 id="org202bfd1">1. 增加依赖项</h3>
<div class="outline-text-3" id="text-org202bfd1">
<p>
为更好的演示打包的效果, 增加一个依赖项.
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">dependency</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">groupId</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">commons-codec</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">groupId</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">artifactId</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">commons-codec</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">artifactId</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">version</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">1.17.2</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">version</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">dependency</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org37be336" class="outline-3">
<h3 id="org37be336">2. 编写代码</h3>
<div class="outline-text-3" id="text-org37be336">
<p>
2.1 编写代码
<code>src/main/java/com/example/App.java</code>
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">package</span> com.<span class="org-constant">example</span>;

<span class="org-keyword">import</span> <span class="org-constant">org</span>.<span class="org-constant">apache</span>.<span class="org-constant">commons</span>.<span class="org-constant">codec</span>.<span class="org-constant">digest</span>.<span class="org-type">DigestUtils</span>;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">App</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {

        <span class="org-keyword">if</span> (args.length &lt; 1) {
            System.err.println(<span class="org-string">"&#35831;&#36755;&#20837;&#20219;&#24847;&#23383;&#31526;&#20018;!"</span>);
            System.exit(0);
        }
        System.out.println(<span class="org-string">"SHA-256&#21704;&#24076;&#20540;&#20026;: "</span> + sha256hex(args[0]));
    }

    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">String</span> <span class="org-function-name">sha256hex</span>(<span class="org-type">String</span> <span class="org-variable-name">input</span>) {
        <span class="org-keyword">return</span> DigestUtils.sha256Hex(input);
    }
}
</pre>
</div>

<p>
2.2 编写单元测试
<code>com/example/AppTest.java</code>
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">package</span> com.<span class="org-constant">example</span>;

<span class="org-keyword">import</span> <span class="org-constant">org</span>.<span class="org-constant">junit</span>.<span class="org-type">Test</span>;

<span class="org-keyword">import</span> <span class="org-keyword">static</span> <span class="org-constant">org</span>.<span class="org-constant">junit</span>.<span class="org-constant">Assert</span>.*;

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">AppTest</span> {

    <span class="org-c-annotation">@Test</span>
    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">sha256hex</span>() {
        assertEquals(<span class="org-string">"8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92"</span>, App.sha256hex(<span class="org-string">"123456"</span>));
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga014e8c" class="outline-3">
<h3 id="orga014e8c">3. maven 构建</h3>
<div class="outline-text-3" id="text-orga014e8c">
<p>
执行 <code>mvn package</code> 完成构建
</p>
<pre class="example" id="org986a280">
$ mvn package
[INFO] Scanning for projects...
[INFO]
[INFO] ---------------------&lt; com.example:my-maven-demo &gt;----------------------
[INFO] Building my-maven-demo 1.0-SNAPSHOT
[INFO]   from pom.xml
[INFO] --------------------------------[ jar ]---------------------------------
[INFO]
[INFO] --- resources:3.3.1:resources (default-resources) @ my-maven-demo ---
[INFO] skip non existing resourceDirectory /tmp/my-maven-demo/src/main/resources
[INFO]
[INFO] --- compiler:3.13.0:compile (default-compile) @ my-maven-demo ---
[INFO] Recompiling the module because of changed source code.
[INFO] Compiling 1 source file with javac [debug target 1.8] to target/classes
[INFO]
[INFO] --- resources:3.3.1:testResources (default-testResources) @ my-maven-demo ---
[INFO] skip non existing resourceDirectory /tmp/my-maven-demo/src/test/resources
[INFO]
[INFO] --- compiler:3.13.0:testCompile (default-testCompile) @ my-maven-demo ---
[INFO] Recompiling the module because of changed dependency.
[INFO] Compiling 1 source file with javac [debug target 1.8] to target/test-classes
[INFO]
[INFO] --- surefire:3.2.5:test (default-test) @ my-maven-demo ---
[INFO] Using auto detected provider org.apache.maven.surefire.junit4.JUnit4Provider
[INFO]
[INFO] -------------------------------------------------------
[INFO]  T E S T S
[INFO] -------------------------------------------------------
[INFO] Running com.example.AppTest
[INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0.111 s -- in com.example.AppTest
[INFO]
[INFO] Results:
[INFO]
[INFO] Tests run: 1, Failures: 0, Errors: 0, Skipped: 0
[INFO]
[INFO]
[INFO] --- jar:3.4.1:jar (default-jar) @ my-maven-demo ---
[INFO] Building jar: /tmp/my-maven-demo/target/my-maven-demo-1.0-SNAPSHOT.jar
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time:  4.145 s
[INFO] Finished at: 2025-01-16T23:40:30+08:00
[INFO] ------------------------------------------------------------------------
</pre>
</div>
</div>
