src/posts/java-learn-maven/index.org
** 4. 运行构建后得到的 jar 包
4.1 尝试执行
#+begin_src shell
  java -cp target/my-maven-demo-1.0-SNAPSHOT.jar com.example.App 123456
#+end_src

发现报错了, 报错原因是根据当前的 pom 文件配置, Maven 不会将项目中的依赖项 =commons-codec= 添加到 jar 文件中。
#+begin_example
Exception in thread "main" java.lang.NoClassDefFoundError: org/apache/commons/codec/digest/DigestUtils
        at com.example.App.sha256hex(App.java:16)
        at com.example.App.main(App.java:12)
Caused by: java.lang.ClassNotFoundException: org.apache.commons.codec.digest.DigestUtils
        at java.net.URLClassLoader.findClass(URLClassLoader.java:387)
        at java.lang.ClassLoader.loadClass(ClassLoader.java:418)
        at sun.misc.Launcher$AppClassLoader.loadClass(Launcher.java:352)
        at java.lang.ClassLoader.loadClass(ClassLoader.java:351)
        ... 2 more
#+end_example

4.2 使用 =maven-shade-plugin= 插件来生成 =fat-jar= - 将所有依赖项打包进同一个 jar 文件中

更新 =pom.xml=
#+begin_src xml
  <build>
    <plugins>
      <plugin>
        <groupId>org.apache.maven.plugins</groupId>
        <artifactId>maven-shade-plugin</artifactId>
        <version>3.6.0</version>
        <executions>
          <!-- 指定该插件的 shade 目标在 Maven 的 package 阶段执行 -->
          <!-- 也就是当运行 mvn package 命令时，该插件的 shade 目标将被自动触发 -->
          <execution>
            <phase>package</phase>
            <goals>
              <goal>shade</goal>
            </goals>
          </execution>
        </executions>
      </plugin>
    </plugins>
  </build>
#+end_src

4.3 重新构建 =mvn clean package=

#+begin_example
  ...
  [INFO] --- jar:3.4.1:jar (default-jar) @ my-maven-demo ---
  [INFO] Building jar: /tmp/my-maven-demo/target/my-maven-demo-1.0-SNAPSHOT.jar
  [INFO]
  [INFO] --- shade:3.6.0:shade (default) @ my-maven-demo ---
  [INFO] Including commons-codec:commons-codec:jar:1.17.2 in the shaded jar.
  [INFO] Dependency-reduced POM written at: /tmp/my-maven-demo/dependency-reduced-pom.xml
  [WARNING] commons-codec-1.17.2.jar, my-maven-demo-1.0-SNAPSHOT.jar define 1 overlapping resource:
  [WARNING]   - META-INF/MANIFEST.MF
  [WARNING] maven-shade-plugin has detected that some files are
  [WARNING] present in two or more JARs. When this happens, only one
  [WARNING] single version of the file is copied to the uber jar.
  [WARNING] Usually this is not harmful and you can skip these warnings,
  [WARNING] otherwise try to manually exclude artifacts based on
  [WARNING] mvn dependency:tree -Ddetail=true and the above output.
  [WARNING] See https://maven.apache.org/plugins/maven-shade-plugin/
  [INFO] Replacing original artifact with shaded artifact.
  [INFO] Replacing /tmp/my-maven-demo/target/my-maven-demo-1.0-SNAPSHOT.jar with /tmp/my-maven-demo/target/my-maven-demo-1.0-SNAPSHOT-shaded.jar
  [INFO] ------------------------------------------------------------------------
  [INFO] BUILD SUCCESS
  [INFO] ------------------------------------------------------------------------
  [INFO] Total time:  4.268 s
  [INFO] Finished at: 2025-01-16T23:58:36+08:00
  [INFO] ------------------------------------------------------------------------
#+end_example

可以看到生成了两个 jar 包, 查看一下它们的文件大小
#+begin_example
  $ ls -lh target
  ...
  -rw-r--r-- 1 demo demo 365K Jan 16 23:58 my-maven-demo-1.0-SNAPSHOT.jar
  -rw-r--r-- 1 demo demo 2.9K Jan 16 23:58 original-my-maven-demo-1.0-SNAPSHOT.jar
  ...
#+end_example

