posts/java-learn-maven/index.html

<div id="outline-container-orged96016" class="outline-3">
<h3 id="orged96016">4. 运行构建后得到的 jar 包</h3>
<div class="outline-text-3" id="text-orged96016">
<p>
4.1 尝试执行
</p>
<div class="org-src-container">
<pre class="src src-shell">java -cp target/my-maven-demo-1.0-SNAPSHOT.jar com.example.App 123456
</pre>
</div>

<p>
发现报错了, 报错原因是根据当前的 pom 文件配置, Maven 不会将项目中的依赖项 <code>commons-codec</code> 添加到 jar 文件中。
</p>
<pre class="example" id="orgc5073fb">
Exception in thread "main" java.lang.NoClassDefFoundError: org/apache/commons/codec/digest/DigestUtils
        at com.example.App.sha256hex(App.java:16)
        at com.example.App.main(App.java:12)
Caused by: java.lang.ClassNotFoundException: org.apache.commons.codec.digest.DigestUtils
        at java.net.URLClassLoader.findClass(URLClassLoader.java:387)
        at java.lang.ClassLoader.loadClass(ClassLoader.java:418)
        at sun.misc.Launcher$AppClassLoader.loadClass(Launcher.java:352)
        at java.lang.ClassLoader.loadClass(ClassLoader.java:351)
        ... 2 more
</pre>

<p>
4.2 使用 <code>maven-shade-plugin</code><sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> 插件来生成 <code>fat-jar</code> - 将所有依赖项打包进同一个 jar 文件中
</p>

<p>
更新 <code>pom.xml</code>
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">build</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">plugins</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">plugin</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">groupId</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">org.apache.maven.plugins</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">groupId</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">artifactId</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">maven-shade-plugin</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">artifactId</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">version</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">3.6.0</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">version</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">executions</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#25351;&#23450;&#35813;&#25554;&#20214;&#30340; shade &#30446;&#26631;&#22312; Maven &#30340; package &#38454;&#27573;&#25191;&#34892;</span><span class="org-comment-delimiter"> --&gt;</span>
        <span class="org-comment-delimiter">&lt;!-- </span><span class="org-comment">&#20063;&#23601;&#26159;&#24403;&#36816;&#34892; mvn package &#21629;&#20196;&#26102;&#65292;&#35813;&#25554;&#20214;&#30340; shade &#30446;&#26631;&#23558;&#34987;&#33258;&#21160;&#35302;&#21457;</span><span class="org-comment-delimiter"> --&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">execution</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">phase</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">package</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">phase</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">goals</span><span class="org-nxml-tag-delimiter">&gt;</span>
            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">goal</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">shade</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">goal</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">goals</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">execution</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">executions</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">plugin</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">plugins</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">build</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>

<p>
4.3 重新构建 <code>mvn clean package</code>
</p>

<pre class="example" id="org074234e">
...
[INFO] --- jar:3.4.1:jar (default-jar) @ my-maven-demo ---
[INFO] Building jar: /tmp/my-maven-demo/target/my-maven-demo-1.0-SNAPSHOT.jar
[INFO]
[INFO] --- shade:3.6.0:shade (default) @ my-maven-demo ---
[INFO] Including commons-codec:commons-codec:jar:1.17.2 in the shaded jar.
[INFO] Dependency-reduced POM written at: /tmp/my-maven-demo/dependency-reduced-pom.xml
[WARNING] commons-codec-1.17.2.jar, my-maven-demo-1.0-SNAPSHOT.jar define 1 overlapping resource:
[WARNING]   - META-INF/MANIFEST.MF
[WARNING] maven-shade-plugin has detected that some files are
[WARNING] present in two or more JARs. When this happens, only one
[WARNING] single version of the file is copied to the uber jar.
[WARNING] Usually this is not harmful and you can skip these warnings,
[WARNING] otherwise try to manually exclude artifacts based on
[WARNING] mvn dependency:tree -Ddetail=true and the above output.
[WARNING] See https://maven.apache.org/plugins/maven-shade-plugin/
[INFO] Replacing original artifact with shaded artifact.
[INFO] Replacing /tmp/my-maven-demo/target/my-maven-demo-1.0-SNAPSHOT.jar with /tmp/my-maven-demo/target/my-maven-demo-1.0-SNAPSHOT-shaded.jar
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESS
[INFO] ------------------------------------------------------------------------
[INFO] Total time:  4.268 s
[INFO] Finished at: 2025-01-16T23:58:36+08:00
[INFO] ------------------------------------------------------------------------
</pre>

<p>
可以看到生成了两个 jar 包, 查看一下它们的文件大小
</p>
<pre class="example" id="org96fa4c5">
$ ls -lh target
...
-rw-r--r-- 1 demo demo 365K Jan 16 23:58 my-maven-demo-1.0-SNAPSHOT.jar
-rw-r--r-- 1 demo demo 2.9K Jan 16 23:58 original-my-maven-demo-1.0-SNAPSHOT.jar
...
</pre>
</div>
</div>
