src/posts/java-learn-maven/index.org
** 5. 第 2 次运行
5.1 尝试运行
#+begin_example
  $ java -cp target/my-maven-demo-1.0-SNAPSHOT.jar com.example.App 123456
  SHA-256哈希值为: 8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92
#+end_example

5.2 很好, 现在执行成功了。但是能不能直接作为 jar 包执行而不用指定主类呢
#+begin_example
  ➜ java -jar target/my-maven-demo-1.0-SNAPSHOT.jar
  no main manifest attribute, in target/my-maven-demo-1.0-SNAPSHOT.jar
#+end_example

5.3 很遗憾，还不可以，可以通过配置 maven-shade-plugin 插件来指定主类
#+begin_src xml
  <plugin>
    <groupId>org.apache.maven.plugins</groupId>
    <artifactId>maven-shade-plugin</artifactId>
    <version>3.6.0</version>
    <executions>
      <execution>
        <phase>package</phase>
        <goals>
          <goal>shade</goal>
        </goals>
        <configuration>
          <transformers>
            <transformer implementation="org.apache.maven.plugins.shade.resource.ManifestResourceTransformer">
              <mainClass>com.example.App</mainClass>
            </transformer>
          </transformers>
        </configuration>
      </execution>
    </executions>
  </plugin>
#+end_src

** 6. 第 3 次运行
6.1 重新打包
#+begin_src shell
  mvn clean package
#+end_src

6.2 作为 jar 包执行
#+begin_example
  ➜ java -jar target/my-maven-demo-1.0-SNAPSHOT.jar
  请输入任意字符串!

  ➜ java -jar target/my-maven-demo-1.0-SNAPSHOT.jar 123456
  SHA-256哈希值为: 8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92
#+end_example

