posts/java-learn-maven/index.html

<div id="outline-container-org1cd2c3f" class="outline-3">
<h3 id="org1cd2c3f">5. 第 2 次运行</h3>
<div class="outline-text-3" id="text-org1cd2c3f">
<p>
5.1 尝试运行
</p>
<pre class="example" id="orgacb51f8">
$ java -cp target/my-maven-demo-1.0-SNAPSHOT.jar com.example.App 123456
SHA-256哈希值为: 8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92
</pre>

<p>
5.2 很好, 现在执行成功了。但是能不能直接作为 jar 包执行而不用指定主类呢
</p>
<pre class="example" id="org4937cbd">
➜ java -jar target/my-maven-demo-1.0-SNAPSHOT.jar
no main manifest attribute, in target/my-maven-demo-1.0-SNAPSHOT.jar
</pre>

<p>
5.3 很遗憾，还不可以，可以通过配置 maven-shade-plugin 插件来指定主类
</p>
<div class="org-src-container">
<pre class="src src-xml"><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">plugin</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">groupId</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">org.apache.maven.plugins</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">groupId</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">artifactId</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">maven-shade-plugin</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">artifactId</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">version</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">3.6.0</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">version</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">executions</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">execution</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">phase</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">package</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">phase</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">goals</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">goal</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">shade</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">goal</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">goals</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">configuration</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">transformers</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">transformer</span> <span class="org-nxml-attribute-local-name">implementation</span>=<span class="org-string">"org.apache.maven.plugins.shade.resource.ManifestResourceTransformer"</span><span class="org-nxml-tag-delimiter">&gt;</span>
            <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-element-local-name">mainClass</span><span class="org-nxml-tag-delimiter">&gt;</span><span class="org-nxml-text">com.example.App</span><span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">mainClass</span><span class="org-nxml-tag-delimiter">&gt;</span>
          <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">transformer</span><span class="org-nxml-tag-delimiter">&gt;</span>
        <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">transformers</span><span class="org-nxml-tag-delimiter">&gt;</span>
      <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">configuration</span><span class="org-nxml-tag-delimiter">&gt;</span>
    <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">execution</span><span class="org-nxml-tag-delimiter">&gt;</span>
  <span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">executions</span><span class="org-nxml-tag-delimiter">&gt;</span>
<span class="org-nxml-tag-delimiter">&lt;</span><span class="org-nxml-tag-slash">/</span><span class="org-nxml-element-local-name">plugin</span><span class="org-nxml-tag-delimiter">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org334764a" class="outline-3">
<h3 id="org334764a">6. 第 3 次运行</h3>
<div class="outline-text-3" id="text-org334764a">
<p>
6.1 重新打包
</p>
<div class="org-src-container">
<pre class="src src-shell">mvn clean package
</pre>
</div>

<p>
6.2 作为 jar 包执行
</p>
<pre class="example" id="org6d3ab0c">
➜ java -jar target/my-maven-demo-1.0-SNAPSHOT.jar
请输入任意字符串!

➜ java -jar target/my-maven-demo-1.0-SNAPSHOT.jar 123456
SHA-256哈希值为: 8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92
</pre>
</div>
</div>
</section>
