src/posts/java-learn-maven/index.org
* 7. 完整的 pom 文件
#+begin_src xml
  <project xmlns="http://maven.apache.org/POM/4.0.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/maven-v4_0_0.xsd">
    <modelVersion>4.0.0</modelVersion>
    <groupId>com.example</groupId>
    <artifactId>my-maven-demo</artifactId>
    <packaging>jar</packaging>
    <version>1.0-SNAPSHOT</version>
    <name>my-maven-demo</name>
    <url>http://maven.apache.org</url>

    <properties>
      <!-- 指定项目构建时的源文件编码格式, 防止源文件中的非 ASCII 字符出现乱码 -->
      <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>
      <!-- 指定项目源代码所使用的 Java 版本 -->
      <maven.compiler.source>1.8</maven.compiler.source>
      <!-- 指定编译后的字节码目标版本 -->
      <maven.compiler.target>1.8</maven.compiler.target>
    </properties>

    <dependencies>
      <dependency>
        <groupId>junit</groupId>
        <artifactId>junit</artifactId>
        <version>4.13.2</version>
        <scope>test</scope>
      </dependency>
      <dependency>
        <groupId>commons-codec</groupId>
        <artifactId>commons-codec</artifactId>
        <version>1.17.2</version>
      </dependency>
    </dependencies>

    <build>
      <plugins>
        <plugin>
          <groupId>org.apache.maven.plugins</groupId>
          <artifactId>maven-shade-plugin</artifactId>
          <version>3.6.0</version>
          <executions>
            <!-- 指定该插件的 shade 目标在 Maven 的 package 阶段执行 -->
            <!-- 也就是当运行 mvn package 命令时，该插件的 shade 目标将被自动触发 -->
            <execution>
              <phase>package</phase>
              <goals>
                <goal>shade</goal>
              </goals>
              <configuration>
                <transformers>
                  <transformer implementation="org.apache.maven.plugins.shade.resource.ManifestResourceTransformer">
                    <mainClass>com.example.App</mainClass>
                  </transformer>
                </transformers>
              </configuration>
            </execution>
          </executions>
        </plugin>
      </plugins>
    </build>

  </project>
#+end_src

